# This file is generated by MATLAB
[net]
batch=64
subdivisiions=1
height=256
width=256
channels=3
momentum=0.9
max_crop=256
learning_rate=0.01
policy=poly
power=4
max_batches=600000
angle=7
saturation=0.75
exposure=0.75
aspect=0.75

# darknet module ID:0
[convolutional]
filters=32
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:1
[maxpool]
size=2
stride=2

# darknet module ID:2
[convolutional]
filters=64
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:3
[maxpool]
size=2
stride=2

# darknet module ID:4
[convolutional]
filters=128
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:5
[convolutional]
filters=64
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:6
[convolutional]
filters=128
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:7
[maxpool]
size=2
stride=2

# darknet module ID:8
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:9
[convolutional]
filters=128
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:10
[convolutional]
filters=256
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:11
[maxpool]
size=2
stride=2

# darknet module ID:12
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:13
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:14
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:15
[convolutional]
filters=256
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:16
[convolutional]
filters=512
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:17
[maxpool]
size=2
stride=2

# darknet module ID:18
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:19
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:20
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:21
[convolutional]
filters=512
size=1
pad=0
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:22
[convolutional]
filters=1024
size=3
pad=1
stride=1
activation=leaky
batch_normalize=1

# darknet module ID:23
[convolutional]
filters=1000
size=1
pad=0
stride=1
activation=linear

# darknet module ID:24
[avgpool]

# darknet module ID:25
[softmax]
groups=1

